<? 
	
	defined("CMS") or die("Restricted usage: " . basename(__FILE__));
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
	function cmsAlert($text) {
		
		$text = addslashes($text);
		$text = str_replace("\n", '\n', $text);
		$text = str_replace("\r", "", $text);
		
		print "\n<script> alert(\"{$text}\"); </script>";
		
	}
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
	function cmsTitle($name, $cms = false) {
		
		if ($cms) $name .= " — {$_SERVER[cmsName]}";
		
		print "\n<script> cmsTitle('{$name}'); </script>";
		
	}
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
	function cmsScript($script) {
		
		print "\n<script> {$script} </script>";
		
	}
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
	function cmsSendValue($k, $v, $type='value') {
		
		$v = str_replace("\r", "", $v);
		$v = addSlashes($v);
		$v = str_replace("\n", "\\n", $v);
		
		print "\n<script> if (top.document.getElementById('{$k}')) top.document.getElementById('{$k}').{$type} = \"{$v}\"; </script>";
		
	}
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
	function cmsReload($time=1000) {
		
		cmsPrint();
		cmsPrint("Через <b>" . number_format($time/1000) . "</b> сек. Вы будете перемещены");
		print "\n<script> setTimeout(top.document.location.reload(), " . $time . "); </script>";
		
	}

	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//////
	
?>