<?
	
	defined("CMS") or die("Restricted usage: " . basename(__FILE__));
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
	function cmsNumeric($n, $multiple, $single = false, $special = false) { // в англ. нет падежей, поэтому только 2 слова
		
		if (is_array($multiple)) {
			
			$single = $multiple[1];
			$special = $multiple[2];
			$multiple = $multiple[0];
			
		}
		
    $n = round(abs($n)) % 100;
    $l = $n % 10;
		
    if ($n > 10 && $n < 20) return $multiple;	// много товар[ов]
    if ($l > 1 && $l < 5) return $special;		// два/три/четыре товар[а]
    if ($l == 1) return $single;							// один товар[]
    return $multiple;													// много товар[ов]
		
		/*
		if ($n == 11 || $n == 12 || $n == 13 || $n == 14) $c = $multiple; // 11, 12, 13, 14 товар[ов] — чтобы не пересечься со следующими двумя условиями
		else if ($l == 1) $c = $single;
		else if ($l == 2 || $l == 3 || $l == 4) $c = $special;
		else $c = $multiple;
		
		return $c;
		*/
		
	}
	
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------//
	
?>